// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. Решаем с помощью "/" и "%", со строками не работаем

// 456 -> 5
// 782 -> 8
// 918 -> 1


// Console.WriteLine("------Первое задание ------");
// Console.WriteLine("Введите трехзначное число");
// int number = int.Parse(Console.ReadLine()!);
// if ((number>=100) && (number<1000)){
//     int num1 = number%100;
//     int num2 = num1/10;
//     Console.WriteLine($"Вторая цифра числа {number} - {num2}"); } 
// else 
// {
//    Console.WriteLine($"Число {number} не трехзначное"); 
//    }

